vvpai9/LPC1768-Motor-Safety-Interlock/Keil_v4/ARM/INC/ADI/ADuC7038.inc
; ===============================================															
; ADuC7038 HEADER FILE REV 1.4															
; ===============================================															
Z_BASE                         EQU       0xFFFF0000
F_BASE                         EQU       0xFFFFF000
MMR_BASE                       EQU       0xFFFF0000
MMR_BASE_LOW                   EQU       0xFFFF0000
MMR_BASE_HIGH                  EQU       0xFFFFF000

; INTERRUPT CONTROLLER

INTBASE                        EQU       0xFFFF0000
IRQSTA                         EQU       0xFFFF0000
IRQSIG                         EQU       0xFFFF0004
IRQEN                          EQU       0xFFFF0008
IRQCLR                         EQU       0xFFFF000C
SWICFG                         EQU       0xFFFF0010
FIQSTA                         EQU       0xFFFF0100
FIQSIG                         EQU       0xFFFF0104
FIQEN                          EQU       0xFFFF0108
FIQCLR                         EQU       0xFFFF010C
Z_IRQSTA                       EQU       IRQSTA    -Z_BASE
Z_IRQSIG                       EQU       IRQSIG    -Z_BASE
Z_IRQEN                        EQU       IRQEN     -Z_BASE
Z_IRQCLR                       EQU       IRQCLR    -Z_BASE
Z_SWICFG                       EQU       SWICFG    -Z_BASE
Z_FIQSTA                       EQU       FIQSTA    -Z_BASE
Z_FIQSIG                       EQU       FIQSIG    -Z_BASE
Z_FIQEN                        EQU       FIQEN     -Z_BASE
Z_FIQCLR                       EQU       FIQCLR    -Z_BASE

T_IRQSTA                       EQU       IRQSTA    -INTBASE   
T_IRQSIG                       EQU       IRQSIG    -INTBASE   
T_IRQEN                        EQU       IRQEN     -INTBASE   
T_IRQCLR                       EQU       IRQCLR    -INTBASE   
T_SWICFG                       EQU       SWICFG    -INTBASE   
T_FIQSTA                       EQU       FIQSTA    -INTBASE   
T_FIQSIG                       EQU       FIQSIG    -INTBASE   
T_FIQEN                        EQU       FIQEN     -INTBASE   
T_FIQCLR                       EQU       FIQCLR    -INTBASE   

IRQSTA_OFFSET                  EQU       0x0000
IRQSIG_OFFSET                  EQU       0x0004
IRQEN_OFFSET                   EQU       0x0008
IRQCLR_OFFSET                  EQU       0x000C
SWICFG_OFFSET                  EQU       0x0010
FIQSTA_OFFSET                  EQU       0x0100
FIQSIG_OFFSET                  EQU       0x0104
FIQEN_OFFSET                   EQU       0x0108
FIQCLR_OFFSET                  EQU       0x010C

; Remap and System Control

REMAPBASE                      EQU       0xFFFF0200
SYSMAP0                        EQU       0xFFFF0220
#if           ALLOW_DEPRECATED_NAMES        
; "SYSMAP" has been deprecated. Use "SYSMAP0" instead.
SYSMAP                         EQU       0xFFFF0220
#endif
RSTSTA                         EQU       0xFFFF0230
RSTCLR                         EQU       0xFFFF0234
SYSCHK                         EQU       0xFFFF0244
Z_SYSMAP0                      EQU       SYSMAP0   -Z_BASE
#if           ALLOW_DEPRECATED_NAMES        
; "Z_SYSMAP" has been deprecated. Use "Z_SYSMAP0" instead.
Z_SYSMAP                       EQU       SYSMAP0   -Z_BASE
#endif
Z_RSTSTA                       EQU       RSTSTA    -Z_BASE
Z_RSTCLR                       EQU       RSTCLR    -Z_BASE
Z_SYSCHK                       EQU       SYSCHK    -Z_BASE

T_SYSMAP0                      EQU       SYSMAP0   -REMAPBASE 
#if           ALLOW_DEPRECATED_NAMES        
; "T_SYSMAP" has been deprecated. Use "T_SYSMAP0" instead.
T_SYSMAP                       EQU       SYSMAP0   -REMAPBASE 
#endif
T_RSTSTA                       EQU       RSTSTA    -REMAPBASE 
T_RSTCLR                       EQU       RSTCLR    -REMAPBASE 
T_SYSCHK                       EQU       SYSCHK    -REMAPBASE 

SYSMAP0_OFFSET                 EQU       0x0220
#if           ALLOW_DEPRECATED_NAMES        
; "SYSMAP_OFFSET" has been deprecated. Use "SYSMAP0_OFFSET" instead.
SYSMAP_OFFSET                  EQU       0xFFFF0220
#endif
RSTSTA_OFFSET                  EQU       0x0230
RSTCLR_OFFSET                  EQU       0x0234
SYSCHK_OFFSET                  EQU       0x0244

; 16 bit General Purpose Timer 0

TIMER0BASE                     EQU       0xFFFF0300
T0LD                           EQU       0xFFFF0300
T0VAL                          EQU       0xFFFF0304
T0CON                          EQU       0xFFFF0308
T0CLRI                         EQU       0xFFFF030C
Z_T0LD                         EQU       T0LD      -Z_BASE
Z_T0VAL                        EQU       T0VAL     -Z_BASE
Z_T0CON                        EQU       T0CON     -Z_BASE
Z_T0CLRI                       EQU       T0CLRI    -Z_BASE

T_T0LD                         EQU       T0LD      -TIMER0BASE
T_T0VAL                        EQU       T0VAL     -TIMER0BASE
T_T0CON                        EQU       T0CON     -TIMER0BASE
T_T0CLRI                       EQU       T0CLRI    -TIMER0BASE

T0LD_OFFSET                    EQU       0x0300
T0VAL_OFFSET                   EQU       0x0304
T0CON_OFFSET                   EQU       0x0308
T0CLRI_OFFSET                  EQU       0x030C

; Wake Up Timer

TIMER1BASE                     EQU       0xFFFF0320
T1LD                           EQU       0xFFFF0320
T1VAL                          EQU       0xFFFF0324
T1CON                          EQU       0xFFFF0328
T1CLRI                         EQU       0xFFFF032C
T1CAP                          EQU       0xFFFF0330
Z_T1LD                         EQU       T1LD      -Z_BASE
Z_T1VAL                        EQU       T1VAL     -Z_BASE
Z_T1CON                        EQU       T1CON     -Z_BASE
Z_T1CLRI                       EQU       T1CLRI    -Z_BASE
Z_T1CAP                        EQU       T1CAP     -Z_BASE

T_T1LD                         EQU       T1LD      -TIMER1BASE
T_T1VAL                        EQU       T1VAL     -TIMER1BASE
T_T1CON                        EQU       T1CON     -TIMER1BASE
T_T1CLRI                       EQU       T1CLRI    -TIMER1BASE
T_T1CAP                        EQU       T1CAP     -TIMER1BASE

T1LD_OFFSET                    EQU       0x0320
T1VAL_OFFSET                   EQU       0x0324
T1CON_OFFSET                   EQU       0x0328
T1CLRI_OFFSET                  EQU       0x032C
T1CAP_OFFSET                   EQU       0x0330

; Watchdog

TIMER2BASE                     EQU       0xFFFF0340
T2LD                           EQU       0xFFFF0340
T2VAL                          EQU       0xFFFF0344
T2CON                          EQU       0xFFFF0348
T2CLRI                         EQU       0xFFFF034C
Z_T2LD                         EQU       T2LD      -Z_BASE
Z_T2VAL                        EQU       T2VAL     -Z_BASE
Z_T2CON                        EQU       T2CON     -Z_BASE
Z_T2CLRI                       EQU       T2CLRI    -Z_BASE

T_T2LD                         EQU       T2LD      -TIMER2BASE
T_T2VAL                        EQU       T2VAL     -TIMER2BASE
T_T2CON                        EQU       T2CON     -TIMER2BASE
T_T2CLRI                       EQU       T2CLRI    -TIMER2BASE

T2LD_OFFSET                    EQU       0x0340
T2VAL_OFFSET                   EQU       0x0344
T2CON_OFFSET                   EQU       0x0348
T2CLRI_OFFSET                  EQU       0x034C

; PLL and Oscillator Control

PLLBASE                        EQU       0xFFFF0400
PLLSTA                         EQU       0xFFFF0400
POWKEY0                        EQU       0xFFFF0404
POWCON                         EQU       0xFFFF0408
POWKEY1                        EQU       0xFFFF040C
PLLKEY0                        EQU       0xFFFF0410
PLLCON                         EQU       0xFFFF0414
PLLKEY1                        EQU       0xFFFF0418
OSC0CON                        EQU       0xFFFF0440
#if           ALLOW_DEPRECATED_NAMES        
; "OSCCON" has been deprecated. Use "OSC0CON" instead.
OSCCON                         EQU       0xFFFF0440
#endif
OSC0STA                        EQU       0xFFFF0444
#if           ALLOW_DEPRECATED_NAMES        
; "OSCSTA" has been deprecated. Use "OSC0STA" instead.
OSCSTA                         EQU       0xFFFF0444
#endif
OSC0VAL0                       EQU       0xFFFF0448
#if           ALLOW_DEPRECATED_NAMES        
; "OSCVAL0" has been deprecated. Use "OSC0VAL0" instead.
OSCVAL0                        EQU       0xFFFF0448
#endif
OSC0VAL1                       EQU       0xFFFF044C
#if           ALLOW_DEPRECATED_NAMES        
; "OSCVAL1" has been deprecated. Use "OSC0VAL1" instead.
OSCVAL1                        EQU       0xFFFF044C
#endif
LOCCON                         EQU       0xFFFF0480
LOCUSR0                        EQU       0xFFFF0484
LOCUSR1                        EQU       0xFFFF0488
LOCMAX                         EQU       0xFFFF048C
LOCMIN                         EQU       0xFFFF0490
LOCSTA                         EQU       0xFFFF0494
LOCVAL0                        EQU       0xFFFF0498
LOCVAL1                        EQU       0xFFFF049C
LOCKEY                         EQU       0xFFFF04A0
Z_PLLSTA                       EQU       PLLSTA    -Z_BASE
Z_POWKEY0                      EQU       POWKEY0   -Z_BASE
Z_POWCON                       EQU       POWCON    -Z_BASE
Z_POWKEY1                      EQU       POWKEY1   -Z_BASE
Z_PLLKEY0                      EQU       PLLKEY0   -Z_BASE
Z_PLLCON                       EQU       PLLCON    -Z_BASE
Z_PLLKEY1                      EQU       PLLKEY1   -Z_BASE
Z_OSC0CON                      EQU       OSC0CON   -Z_BASE
#if           ALLOW_DEPRECATED_NAMES        
; "Z_OSCCON" has been deprecated. Use "Z_OSC0CON" instead.
Z_OSCCON                       EQU       OSC0CON   -Z_BASE
#endif
Z_OSC0STA                      EQU       OSC0STA   -Z_BASE
#if           ALLOW_DEPRECATED_NAMES        
; "Z_OSCSTA" has been deprecated. Use "Z_OSC0STA" instead.
Z_OSCSTA                       EQU       OSC0STA   -Z_BASE
#endif
Z_OSC0VAL0                     EQU       OSC0VAL0  -Z_BASE
#if           ALLOW_DEPRECATED_NAMES        
; "Z_OSCVAL0" has been deprecated. Use "Z_OSC0VAL0" instead.
Z_OSCVAL0                      EQU       OSC0VAL0  -Z_BASE
#endif
Z_OSC0VAL1                     EQU       OSC0VAL1  -Z_BASE
#if           ALLOW_DEPRECATED_NAMES        
; "Z_OSCVAL1" has been deprecated. Use "Z_OSC0VAL1" instead.
Z_OSCVAL1                      EQU       OSC0VAL1  -Z_BASE
#endif
Z_LOCCON                       EQU       LOCCON    -Z_BASE
Z_LOCUSR0                      EQU       LOCUSR0   -Z_BASE
Z_LOCUSR1                      EQU       LOCUSR1   -Z_BASE
Z_LOCMAX                       EQU       LOCMAX    -Z_BASE
Z_LOCMIN                       EQU       LOCMIN    -Z_BASE
Z_LOCSTA                       EQU       LOCSTA    -Z_BASE
Z_LOCVAL0                      EQU       LOCVAL0   -Z_BASE
Z_LOCVAL1                      EQU       LOCVAL1   -Z_BASE
Z_LOCKEY                       EQU       LOCKEY    -Z_BASE

T_PLLSTA                       EQU       PLLSTA    -PLLBASE   
T_POWKEY0                      EQU       POWKEY0   -PLLBASE   
T_POWCON                       EQU       POWCON    -PLLBASE   
T_POWKEY1                      EQU       POWKEY1   -PLLBASE   
T_PLLKEY0                      EQU       PLLKEY0   -PLLBASE   
T_PLLCON                       EQU       PLLCON    -PLLBASE   
T_PLLKEY1                      EQU       PLLKEY1   -PLLBASE   
T_OSC0CON                      EQU       OSC0CON   -PLLBASE   
#if           ALLOW_DEPRECATED_NAMES        
; "T_OSCCON" has been deprecated. Use "T_OSC0CON" instead.
T_OSCCON                       EQU       OSC0CON   -PLLBASE   
#endif
T_OSC0STA                      EQU       OSC0STA   -PLLBASE   
#if           ALLOW_DEPRECATED_NAMES        
; "T_OSCSTA" has been deprecated. Use "T_OSC0STA" instead.
T_OSCSTA                       EQU       OSC0STA   -PLLBASE   
#endif
T_OSC0VAL0                     EQU       OSC0VAL0  -PLLBASE   
#if           ALLOW_DEPRECATED_NAMES        
; "T_OSCVAL0" has been deprecated. Use "T_OSC0VAL0" instead.
T_OSCVAL0                      EQU       OSC0VAL0  -PLLBASE   
#endif
T_OSC0VAL1                     EQU       OSC0VAL1  -PLLBASE   
#if           ALLOW_DEPRECATED_NAMES        
; "T_OSCVAL1" has been deprecated. Use "T_OSC0VAL1" instead.
T_OSCVAL1                      EQU       OSC0VAL1  -PLLBASE   
#endif
T_LOCCON                       EQU       LOCCON    -PLLBASE   
T_LOCUSR0                      EQU       LOCUSR0   -PLLBASE   
T_LOCUSR1                      EQU       LOCUSR1   -PLLBASE   
T_LOCMAX                       EQU       LOCMAX    -PLLBASE   
T_LOCMIN                       EQU       LOCMIN    -PLLBASE   
T_LOCSTA                       EQU       LOCSTA    -PLLBASE   
T_LOCVAL0                      EQU       LOCVAL0   -PLLBASE   
T_LOCVAL1                      EQU       LOCVAL1   -PLLBASE   
T_LOCKEY                       EQU       LOCKEY    -PLLBASE   

